Code/BORGEmail/readme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>CSSE 375 BORG Test Insertion Assignment</title>
<!-- 2015-05-12 Tue 09:41 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Buffalo" />
</head>
<body>
<div id="content">
<h1 class="title">CSSE 375 BORG Test Insertion Assignment</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. The Code</a></li>
<li><a href="#sec-3">3. Installing lombok</a></li>
<li><a href="#sec-4">4. Your Assignment</a></li>
<li><a href="#sec-5">5. How to Submit your Code</a></li>
<li><a href="#sec-6">6. Grading</a></li>
<li><a href="#sec-7">7. Something to be careful of</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This is an exercise designed to familiarize you with the techniques in
Michael Feather's book, chapter 9 and 10.
</p>

<p>
In particular, you will probably want to use:
</p>

<ul class="org-ul">
<li>Extract Interface (362)
</li>
<li>Extract Method (415)
</li>
<li>Subclass and Override Method (401)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> The Code</h2>
<div class="outline-text-2" id="text-2">
<p>
This code is taken from the BORG Java Calendar project
(<a href="https://mikeberger.github.io/borg_calendar/">https://mikeberger.github.io/borg_calendar/</a>).  This is not the
complete project, because building it requires some complicated
libraries and is a pain.  It also has been modified s lightly to reduce
the difficulty of the assignment, but it is still fairly realistic.
</p>

<p>
You should be able to get the code from your svn repo.
</p>

<p>
Take a look at this file:
[<a href="src/net/sf/borg/model/EmailReminder.java">src/net/sf/borg/model/EmailReminder.java</a>]
</p>

<p>
This is code designed to send daily reminder emails with a summary of
the day's activities.  Your goal will be to test the sendEmail method.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Installing lombok</h2>
<div class="outline-text-2" id="text-3">
<p>
So I've discovered that the BORG project requires an external library
to be installed on your eclipse.  I didn't notice because it was
already installed on mine.  The library to want to install is lombok.
You can probably install it by simply double clicking on the
lombok.jar included with your project download and installing it on
your eclipse.
</p>

<p>
If you have permission problems, it may be that you have to run it as
administrator.  To do that:
</p>

<ol class="org-ol">
<li>Type cmd in your windows search bar
</li>
<li>Right click the Cmd.exe that should come up and select Run As
Administrator
</li>
<li>At the command line type
<pre class="example">
java -jar C:\Wherever\lombok.jar"
</pre>
<p>
then proceed with the install from there.
</p>
</li>
</ol>

<p>
Once your install lombok you must also:
</p>

<ul class="org-ul">
<li>Restart eclipse
</li>

<li>Clean your project (Project -&gt; Clean&#x2026; -&gt; Select BORGEmail and click OK)
</li>
</ul>

<p>
If you have trouble, stop by and see me!
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Your Assignment</h2>
<div class="outline-text-2" id="text-4">
<p>
Write a unit test for the send email method.  Of course this test
should not actually send email.  Your test should test two things:
</p>

<ol class="org-ol">
<li>Test that when multiple email addresses are specified in the form
"email1@foo.com,email2@foo.com", the system sends 2 messages (not
one message to a bogus address).
</li>

<li>Ensure that the first line of the appointment text is included in
the message body.
</li>
</ol>

<p>
You should change the sendEmail method and other parts of the code as
little as possible, but you can change them.  Use automated UI
refactoring tools as much as possible to ensure your change does not
introduce much risk.
</p>

<p>
You should not need to use a Mocking framework or any other
specialized testing tool beyond jUnit.
</p>

<p>
Write your test code + any classes you add to the system in the
(already created) package yourCodeGoesHere.
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> How to Submit your Code</h2>
<div class="outline-text-2" id="text-5">
<p>
You will submit via SVN.
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Grading</h2>
<div class="outline-text-2" id="text-6">
<p>
If your test works and the rest of the code is only slightly modified
you should get 10/10.
</p>

<p>
If the test works but the code seems greatly changed, 6/10.
</p>

<p>
If you were unable to get the code under test but clearly made an
attempt along the lines of Feather's approach, 4/10.
</p>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Something to be careful of</h2>
<div class="outline-text-2" id="text-7">
<p>
Under no circumstances should you be <b>copying</b> code from the original
function under test into your your testing classes.  For example,
here's an incorrect approach that was submitted:
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #0000FF;">private</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">TestingEmailReminder</span> <span style="color: #0000FF;">extends</span> <span style="color: #6434A3;">EmailReminder</span> {

        <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">ArrayList</span>&lt;<span style="color: #6434A3;">String</span>&gt; <span style="color: #BA36A5;">appointmentTexts</span>;
        <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">ArrayList</span>&lt;<span style="color: #6434A3;">String</span>&gt; <span style="color: #BA36A5;">emailAddresses</span>;
        <span style="color: #0000FF;">public</span> <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">emailsSent</span>;

        <span style="color: #0000FF;">public</span> <span style="color: #006699;">TestingEmailReminder</span>(<span style="color: #6434A3;">AppointmentModelInterface</span> <span style="color: #BA36A5;">appointments</span>) {
                <span style="color: #0000FF;">super</span>(appointments);
                <span style="color: #0000FF;">this</span>.appointmentTexts = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">ArrayList</span>&lt;<span style="color: #6434A3;">String</span>&gt;();
                <span style="color: #0000FF;">this</span>.emailAddresses = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">ArrayList</span>&lt;<span style="color: #6434A3;">String</span>&gt;();
                <span style="color: #0000FF;">this</span>.emailsSent = 0;
        }

        <span style="color: #D0372D;">@Override</span>
        <span style="color: #0000FF;">protected</span> <span style="color: #6434A3;">String</span> <span style="color: #006699;">addAppointmentText</span>(<span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">tx</span>, <span style="color: #6434A3;">Appointment</span> <span style="color: #BA36A5;">appt</span>) {
                <span style="color: #0000FF;">if</span> (appt.isEncrypted())
                        tx += Resource.getResourceString(<span style="color: #008000;">"EncryptedItemShort"</span>);
                <span style="color: #0000FF;">else</span> {
                        <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">only show first line of appointment text</span>
                        <span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">s</span> = appt.getText();
                        <span style="color: #0000FF;">this</span>.appointmentTexts.add(s);
                        <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">ii</span> = s.indexOf(<span style="color: #008000;">'\n'</span>);
                        <span style="color: #0000FF;">if</span> (ii != -1) {
                                tx += s.substring(0, ii);
                        } <span style="color: #0000FF;">else</span> {
                                tx += s;
                        }
                }
                <span style="color: #0000FF;">return</span> tx;
        }

<span style="color: #8D8D84;">//</span><span style="color: #8D8D84; font-style: italic;">even more copied code below this</span>
</pre>
</div>

<p>
See how addAppointmentText basically has code copied from
EmailReminder?  This is <b>very</b> bad.  Why?  Because the test implies
that it tests the original code, but actually it is testing a copy of
the original code in a test class.  If the original code changes
(perhaps gets a bug added) this test won't detect it because it is
still testing the code in the test class.
</p>

<p>
This is a lot different than something like:
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #0000FF;">public</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">TestingClass</span> <span style="color: #0000FF;">extends</span> <span style="color: #6434A3;">RealClass</span> {
    <span style="color: #D0372D;">@Override</span>
    <span style="color: #0000FF;">protected</span> <span style="color: #6434A3;">int</span> <span style="color: #006699;">displayIntegerEntryPopupDialog</span>() {
        <span style="color: #0000FF;">return</span> 4;
    }
}
</pre>
</div>

<p>
Because the goal of the test is not to check that the dialog displays
correctly.  In the BORGEmail case, our goal is to ensure that the
email's contents are correct which means we need to test the real code
for that.  But it is not our goal to ensure that SendJavaMail.sendMail
works - so we can pull out that part if necessary.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Buffalo</p>
<p class="date">Created: 2015-05-12 Tue 09:41</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
